
/**
 * @page synopsis Проект: Поисковая система на C++
 *
 * @section synopsis_sec Описание
 *
 * Проект представляет собой программное решение для организации поисковой системы. Он включает в себя
 * реализацию алгоритмов поиска, обработку текстовых документов и управление базой данных документов.
 *
 * @section purpose_sec Цель проекта
 *
 *
 * - Цель проекта - предоставить эффективный и удобный в использовании инструмент для поиска и анализа текстовых документов.
 * - Цель этой работы - показать работадателю, что я заинтересован в вакансии и могу освоить новое для себя ПО.
 * @section features_sec Основные особенности
 *
 * - Поддержка добавления новых документов с учетом их статуса и рейтинга.
 * - Выполнение поисковых запросов с возможностью фильтрации по статусу документа.
 * - Реализация TF-IDF для определения релевантности документов к запросу.
 * - Возможность работы с плюс-словами и минус-словами для точной настройки поиска.
 *
 * @section usage_sec Использование
 *
 * Проект можно использовать для поиска информации в больших текстовых коллекциях, а также для
 * оценки релевантности и качества документов в базе данных. Он может быть полезен для создания
 * поисковых систем, аналитических инструментов и других приложений, требующих анализа текстовых данных.
 */
